In [2]:
import pandas as pd
import numpy as np
import streamlit as st

In [3]:
data = pd.read_csv("../data/calgary.csv")
# df = data[['time','mean_temp']]
# pd.to_datetime(data['time'])
# # print(data)
# print(df)
# st.map(data)

# st.line_chart(df, y=data['mean_temp'])
data

           time        lat         lon  mean_temp
0    01-01-1950  51.041666 -114.041668       4.37
1    01-01-1951  51.041666 -114.041668       3.81
2    01-01-1952  51.041666 -114.041668       3.90
3    01-01-1953  51.041666 -114.041668       3.90
4    01-01-1954  51.041666 -114.041668       3.89
..          ...        ...         ...        ...
146  01-01-2096  51.041666 -114.041668      10.24
147  01-01-2097  51.041666 -114.041668      10.56
148  01-01-2098  51.041666 -114.041668      11.05
149  01-01-2099  51.041666 -114.041668      11.61
150  01-01-2100  51.041666 -114.041668      10.93

[151 rows x 4 columns]

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 151 entries, 0 to 150
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   time       151 non-null    object
 1   lat        151 non-null    float64
 2   lon        151 non-null    float64
 3   mean_temp  151 non-null    float64
dtypes: float64(3), object(1)
memory usage: 4.8+ KB

In [6]:
data['time']= pd.to_datetime(data['time'])

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 151 entries, 0 to 150
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   time       151 non-null    datetime64[ns]
 1   lat        151 non-null    float64
 2   lon        151 non-null    float64
 3   mean_temp  151 non-null    float64
dtypes: datetime64[ns](1), float64(3)
memory usage: 4.8 KB

In [9]:
data

          time        lat         lon  mean_temp
0   1950-01-01  51.041666 -114.041668       4.37
1   1951-01-01  51.041666 -114.041668       3.81
2   1952-01-01  51.041666 -114.041668       3.90
3   1953-01-01  51.041666 -114.041668       3.90
4   1954-01-01  51.041666 -114.041668       3.89
..         ...        ...         ...        ...
146 2096-01-01  51.041666 -114.041668      10.24
147 2097-01-01  51.041666 -114.041668      10.56
148 2098-01-01  51.041666 -114.041668      11.05
149 2099-01-01  51.041666 -114.041668      11.61
150 2100-01-01  51.041666 -114.041668      10.93

[151 rows x 4 columns]

In [17]:
df = data[['time', 'mean_temp']]
df.index = data['time']
df = df.drop('time', axis=1)
df

            mean_temp
time
1950-01-01       4.37
1951-01-01       3.81
1952-01-01       3.90
1953-01-01       3.90
1954-01-01       3.89
...               ...
2096-01-01      10.24
2097-01-01      10.56
2098-01-01      11.05
2099-01-01      11.61
2100-01-01      10.93

[151 rows x 1 columns]

In [12]:
# st.line_chart(data, x=data['time'], y = data['mean_temp'])

In [18]:
st.line_chart(df)

2023-08-02 01:08:35.622
  Warning: to view this Streamlit app on a browser, run it with the following
  command:

    streamlit run C:\Users\NEXT\AppData\Roaming\Python\Python310\site-packages\ipykernel_launcher.py [ARGUMENTS]

DeltaGenerator()

In [19]:
streamlit run C:\Users\NEXT\AppData\Roaming\Python\Python310\site-packages\ipykernel_launcher.py

SyntaxError: invalid syntax (1878284390.py, line 1)